docs/tweens.reveal.html
<!DOCTYPE html><html lang="es"><head><meta charset="utf-8"><title>Tweens en Phaser</title><meta name="author" content="Carlos León"><link rel="stylesheet" href="/tooling.reveal.4b097e00.css"><link rel="stylesheet" href="/tooling.reveal.64dafdde.css" id="theme"><link rel="stylesheet" href="/tooling.reveal.c1a625de.css"><link rel="stylesheet" href="/tooling.reveal.fdb16a0d.css"></head><body> <div class="reveal"> <div class="slides"> <section id="sec-title-slide"> <h1 class="title">Tweens en Phaser</h1><h2 class="author">Carlos León</h2><h2 class="email"><a href="mailto:cleon@ucm.es">cleon@ucm.es</a></h2> </section> <section> <section id="slide-más-sobre-animación"> <h2 id="más-sobre-animación">Más sobre animación</h2> </section> <section> <p> Las animaciones que hemos utilizado hasta ahora son <i>animaciones por frames</i>, es decir, dibujamos <b>todas</b> las imágenes o frames que componen la animación </p> </section> <section> <p> En la animación tradicional existe la figura del <i>in-between artist</i>, el artista encargado de dibujar las animaciones entre dos poses de un personaje para hacer que la transición entre dos animaciones sea lo más suave posible </p> <blockquote> <p> Hayao Miyazaki comenzó como in-between artist en Toei Animation </p> </blockquote> </section> <section> <blockquote> <p> Estas animaciones <i>in between</i> también se conocen como <b>tweens</b> </p> </blockquote> <iframe width="560" height="315" src="https://www.youtube.com/embed/sJIeAKwDzSw" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen> </iframe> </section> <section> <p> En un motor de videojuegos, un <b>tween</b> es una animación procedural sencilla, creada en base a modificar el valor de un atributo a partir de un valor inicial, un valor final, un intervalo de tiempo y una función de interpolación: </p> <ul> <li>Un powerup que se agranda y se contrae</li> <li>Una plataforma que oscila arriba y abajo</li> <li>Una moneda que rota</li> <li>Una desaparición de un enemigo muerto</li> <li>Un objeto que va cambiando de color</li> <li>&#x2026;</li> </ul> </section> </section> <section> <section id="slide-tweens-en-phaser"> <h2 id="tweens-en-phaser">Tweens en Phaser</h2> </section> <section> <p> Para crear un tween usamos el objeto factoría de Scene </p> <div class="org-src-container"> <pre><code class="js">// this es Scene
let image = this.add.image(100, 80, 'fish', 0);

// Animación para mover de lado a lado una imagen
let tween = this.tweens.add({
    targets: [ image ],
    x: 700,
    duration: 4000,
    ease: 'Sine.easeInOut',
    flipX: true,
    yoyo: true,
    repeat: -1,
    delay: 10
});
</code></pre> </div> <p> Revisa todas las <a href="https://newdocs.phaser.io/docs/3.55.2/Phaser.Types.Tweens.TweenBuilderConfig">propiedades con las que se puede configurar un tween</a> </p> </section> <section> <p> Existen una gran variedad de <a href="https://github.com/photonstorm/phaser/blob/v3.55.2/src/math/easing/EaseMap.js">funciones de interpolación (<code>ease</code>) predefinidas</a>. </p> <blockquote> <p> Puedes hacerte una idea del comportamiento de cada función <a href="https://easings.net/">en esta página web</a> </p> </blockquote> </section> <section> <p> Podemos suscribirnos a <a href="https://newdocs.phaser.io/docs/3.55.2/events">eventos que generan los Tweens</a>: </p> <div class="org-src-container"> <pre><code class="js">let tween = this.tweens.add({
    targets: image,
    x: 500,
    ease: 'Power1',
    duration: 3000
});
tween.on('stop', listener);

function listener() {
    // hacemos algo cuando termina el tween
}
</code></pre> </div> </section> <section> <p> Podemos encadenar tweens <a href="https://newdocs.phaser.io/docs/3.55.2/Phaser.Types.Tweens.TimelineBuilderConfig">creando un <code>timeline</code></a>: </p> <div class="org-src-container"> <pre><code class="js">// this es Scene
var timeline = this.tweens.createTimeline();
// Primer tween 
timeline.add({
    targets: image,
    x: 600,
    ease: 'Power1',
    duration: 3000
});
// Segundo tween; se ejecuta al terminar el primero
timeline.add({
    targets: image,
    y: 500,
    ease: 'Power1',
    duration: 3000
});
...

timeline.play();
</code></pre> </div> <p> Tienes un ejemplo de uso <a href="https://labs.phaser.io/edit.html?src=src/tweens%5Ctimelines%5Ccreate%20timeline.js">en esta página</a> </p> </section> </section> </div> </div> <script src="/tooling.reveal.62c78f3a.js"></script> <script src="/tooling.reveal.f05d24be.js"></script> <script src="/tooling.reveal.f6a6f820.js"></script> <script src="/tooling.reveal.d2982244.js"></script> <script>Reveal.initialize({controls:!0,progress:!0,history:!0,center:!0,slideNumber:"c",rollingLinks:!1,keyboard:!0,mouseWheel:!1,fragmentInURL:!1,hashOneBasedIndex:!1,pdfSeparateFragments:!0,overview:!0,transition:"none",transitionSpeed:"default",plugins:[RevealSearch,RevealHighlight,RevealZoom],dependencies:[]});</script> </body></html>